#+TITLE: Erks Literate Config

# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup

* Magit
#+BEGIN_SRC emacs-lisp
;; (unmap! :leader
  ;; (:prefix "g"
    ;; ))
(map! :leader
      (:prefix "g"
        :desc "blame" "b" #'magit-blame
        :desc "status dwim" "g" #'magit-status
        :desc "status" "G" #'my/magit-status
        :desc "buffer-lock" "T" #'magit-toggle-buffer-lock

        ;; Git gutter
        :desc "next-hunk" "j" #'git-gutter:next-hunk
        :desc "prev-hunk" "k" #'git-gutter:previous-hunk
        :desc "popup-diff" "d" #'git-gutter:popup-diff
        :desc "file-statistics" "S" #'git-gutter:statistic

        ;; Log
        :desc "log" "l" #'magit-log
        "L" nil ;; unmap default L mapping
        (:prefix ("L" . "log")
          :desc "file" "f" #'magit-log-buffer-file
          :desc "head" "h" #'magit-log-head
          :desc "log" "i" #'magit-log
          :desc "refresh" "r" #'magit-log-refresh-buffer)))

;; (define-suffix-command reset-upstream ()
  ;; (interactive)
  ;; (if (magit-confirm t (format "**WARNING** this will hard reset to upstream branch. Continue?"))
  ;;     (magit-run-git "reset" "--hard" "@{u}"))
  ;; )

;; (define-suffix-command fixup-head ()
;;   "Make current commit a fixup to HEAD"
;;   ;; (interactive)
;;   (magit-run-git "commit" "--fixup" "HEAD")
;;   )

;; (define-suffix-command reset-head-to-previous-commit ()
;;   "Soft reset head to the previous commit"
;;   ;; (interactive)
;;   (magit-run-git "reset" "HEAD~")
;;   )

(with-eval-after-load 'magit
  ;; Navigation
  (define-key magit-mode-map (kbd "M-j") 'magit-section-forward)
  (define-key magit-mode-map (kbd "M-k") 'magit-section-backward)
  (define-key magit-mode-map (kbd "C-M-j") 'magit-section-forward-sibling)
  (define-key magit-mode-map (kbd "C-M-k") 'magit-section-backward-sibling)
  (define-key magit-mode-map (kbd "C-K") 'magit-section-up)

  ;; Section folding/expansion
  (define-key magit-mode-map (kbd "M-o") 'magit-section-toggle)
  (define-key magit-mode-map (kbd "C-o") 'magit-section-cycle)

  ;; Register Custom Commands
 ;; (transient-append-suffix 'magit-commit "c"
 ;;                         '("h" "fixup head" fixup-head))

 ;; (transient-append-suffix 'magit-reset "f"
 ;;                         '("u" "to upstream" reset-upstream))

 ;; (transient-append-suffix 'magit-reset "w"
 ;;                         '("o" "previous-commit" reset-head-to-previous-commit))
 )

(with-eval-after-load 'evil
  (with-eval-after-load 'magit
 (evil-define-key* '(normal visual) magit-mode-map
   "C-t" #'my/evil-scroll-down
   "C-v" #'my/evil-scroll-up)
))

;; Automatically refresh status buffer
(add-hook 'after-save-hook 'magit-after-save-refresh-status t)

;; Prevent long refnames from hiding commit messages in the log
(setq magit-log-show-refname-after-summary t)
(setq magit-log-margin '(t age-abbreviated 15 t 10))

(defun my/magit-status ()
  "Use ivy to specify directory from which to open a magit status buffer.
Default starting place is the home directory."
  (interactive)
  (let ((default-directory "~/"))
    (ivy-read "git status: " #'read-file-name-internal
              :matcher #'counsel--find-file-matcher
              :action #'(lambda (x)
                          (magit-status x))
              :preselect (counsel--preselect-file)
              :require-match 'confirm-after-completion
              :history 'file-name-history
              :keymap counsel-find-file-map
              :caller 'my/magit-status)))

(defun my/magit-status-2 ()
  (interactive)
  (execute-extended-command 16 "magit-status"))
  ;; (counsel--find-file-1 "Git status: " "" #'magit-status 'my/magit-status)
  ;; (ivy-read  "my prompt: " (directory-files "~")
  ;;            :action #'(lambda (x)
  ;;                        (magit-status x))))
;; (lambda (x)
;;   "Return the hyperbolic cosine of X."
;;   (* 0.5 (+ (exp x) (exp (- x)))))
;; List of repositories
(setq magit-repository-directories
      `(("~" . 1)))
;;       `(("~/release"      . 1)
;;         ("~/kinetis"      . 1)
;;         ("~/dark_helmet"  . 1)))
        ;; ("~/dark_helment" . DEPTH3)))

;; (setq magit-repolist-columns
;;       '(("Name"    25 magit-repolist-column-ident                  ())
;;         ("Version" 25 magit-repolist-column-version                ())
;;         ("D"        1 magit-repolist-column-dirty                  ())
;;         ("L<U"      3 magit-repolist-column-unpulled-from-upstream ((:right-align t)))
;;         ("L>U"      3 magit-repolist-column-unpushed-to-upstream   ((:right-align t)))
;;         ("Path"    99 magit-repolist-column-path                   ())))

;; ;; Consistent Navigation
;; ;; (define-key magit-mode-map [remap evil-scroll-down] 'my/evil-scroll-down)
;; ;; (define-key magit-mode-map [remap evil-scroll-up]   'my/evil-scroll-up)
#+END_SRC

#+RESULTS:
: ((~ . 1))

